frostfire45/Codewarrior/Lib/hc12c/include/mc9s12xs64.h
  struct {
    word DDR1AD00    :1;                                       /* Port AD0 data direction bit 0 */
    word DDR1AD01    :1;                                       /* Port AD0 data direction bit 1 */
    word DDR1AD02    :1;                                       /* Port AD0 data direction bit 2 */
    word DDR1AD03    :1;                                       /* Port AD0 data direction bit 3 */
    word DDR1AD04    :1;                                       /* Port AD0 data direction bit 4 */
    word DDR1AD05    :1;                                       /* Port AD0 data direction bit 5 */
    word DDR1AD06    :1;                                       /* Port AD0 data direction bit 6 */
    word DDR1AD07    :1;                                       /* Port AD0 data direction bit 7 */
    word DDR0AD00    :1;                                       /* Port AD0 data direction bit 8 */
    word DDR0AD01    :1;                                       /* Port AD0 data direction bit 9 */
    word DDR0AD02    :1;                                       /* Port AD0 data direction bit 10 */
    word DDR0AD03    :1;                                       /* Port AD0 data direction bit 11 */
    word DDR0AD04    :1;                                       /* Port AD0 data direction bit 12 */
    word DDR0AD05    :1;                                       /* Port AD0 data direction bit 13 */
    word DDR0AD06    :1;                                       /* Port AD0 data direction bit 14 */
    word DDR0AD07    :1;                                       /* Port AD0 data direction bit 15 */
  } Bits;
  struct {
    word grpDDR1AD0 :8;
    word grpDDR0AD0 :8;
  } MergedBits;
} DDR01AD0STR;
extern volatile DDR01AD0STR _DDR01AD0 @(REG_BASE + 0x00000272UL);
#define DDR01AD0                        _DDR01AD0.Word
#define DDR01AD0_DDR1AD00               _DDR01AD0.Bits.DDR1AD00
#define DDR01AD0_DDR1AD01               _DDR01AD0.Bits.DDR1AD01
#define DDR01AD0_DDR1AD02               _DDR01AD0.Bits.DDR1AD02
#define DDR01AD0_DDR1AD03               _DDR01AD0.Bits.DDR1AD03
#define DDR01AD0_DDR1AD04               _DDR01AD0.Bits.DDR1AD04
#define DDR01AD0_DDR1AD05               _DDR01AD0.Bits.DDR1AD05
#define DDR01AD0_DDR1AD06               _DDR01AD0.Bits.DDR1AD06
#define DDR01AD0_DDR1AD07               _DDR01AD0.Bits.DDR1AD07
#define DDR01AD0_DDR0AD00               _DDR01AD0.Bits.DDR0AD00
#define DDR01AD0_DDR0AD01               _DDR01AD0.Bits.DDR0AD01
#define DDR01AD0_DDR0AD02               _DDR01AD0.Bits.DDR0AD02
#define DDR01AD0_DDR0AD03               _DDR01AD0.Bits.DDR0AD03
#define DDR01AD0_DDR0AD04               _DDR01AD0.Bits.DDR0AD04
#define DDR01AD0_DDR0AD05               _DDR01AD0.Bits.DDR0AD05
#define DDR01AD0_DDR0AD06               _DDR01AD0.Bits.DDR0AD06
#define DDR01AD0_DDR0AD07               _DDR01AD0.Bits.DDR0AD07
#define DDR01AD0_DDR1AD0                _DDR01AD0.MergedBits.grpDDR1AD0
#define DDR01AD0_DDR0AD0                _DDR01AD0.MergedBits.grpDDR0AD0

#define DDR01AD0_DDR1AD00_MASK          1U
#define DDR01AD0_DDR1AD01_MASK          2U
#define DDR01AD0_DDR1AD02_MASK          4U
#define DDR01AD0_DDR1AD03_MASK          8U
#define DDR01AD0_DDR1AD04_MASK          16U
#define DDR01AD0_DDR1AD05_MASK          32U
#define DDR01AD0_DDR1AD06_MASK          64U
#define DDR01AD0_DDR1AD07_MASK          128U
#define DDR01AD0_DDR0AD00_MASK          256U
#define DDR01AD0_DDR0AD01_MASK          512U
#define DDR01AD0_DDR0AD02_MASK          1024U
#define DDR01AD0_DDR0AD03_MASK          2048U
#define DDR01AD0_DDR0AD04_MASK          4096U
#define DDR01AD0_DDR0AD05_MASK          8192U
#define DDR01AD0_DDR0AD06_MASK          16384U
#define DDR01AD0_DDR0AD07_MASK          32768U
#define DDR01AD0_DDR1AD0_MASK           255U
#define DDR01AD0_DDR1AD0_BITNUM         0U
#define DDR01AD0_DDR0AD0_MASK           65280U
#define DDR01AD0_DDR0AD0_BITNUM         8U


/*** RDR01AD0 - Port AD0 Reduced Drive Register; 0x00000274 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** RDR0AD0 - Port AD0H Reduced Drive Register; 0x00000274 ***/
    union {
      byte Byte;
      struct {
        byte RDR0AD00    :1;                                       /* Port AD0H reduced drive bit 0 */
        byte RDR0AD01    :1;                                       /* Port AD0H reduced drive bit 1 */
        byte RDR0AD02    :1;                                       /* Port AD0H reduced drive bit 2 */
        byte RDR0AD03    :1;                                       /* Port AD0H reduced drive bit 3 */
        byte RDR0AD04    :1;                                       /* Port AD0H reduced drive bit 4 */
        byte RDR0AD05    :1;                                       /* Port AD0H reduced drive bit 5 */
        byte RDR0AD06    :1;                                       /* Port AD0H reduced drive bit 6 */
        byte RDR0AD07    :1;                                       /* Port AD0H reduced drive bit 7 */
      } Bits;
    } RDR0AD0STR;
    #define RDR0AD0                     _RDR01AD0.Overlap_STR.RDR0AD0STR.Byte
    #define RDR0AD0_RDR0AD00            _RDR01AD0.Overlap_STR.RDR0AD0STR.Bits.RDR0AD00
    #define RDR0AD0_RDR0AD01            _RDR01AD0.Overlap_STR.RDR0AD0STR.Bits.RDR0AD01
    #define RDR0AD0_RDR0AD02            _RDR01AD0.Overlap_STR.RDR0AD0STR.Bits.RDR0AD02
    #define RDR0AD0_RDR0AD03            _RDR01AD0.Overlap_STR.RDR0AD0STR.Bits.RDR0AD03
    #define RDR0AD0_RDR0AD04            _RDR01AD0.Overlap_STR.RDR0AD0STR.Bits.RDR0AD04
    #define RDR0AD0_RDR0AD05            _RDR01AD0.Overlap_STR.RDR0AD0STR.Bits.RDR0AD05
    #define RDR0AD0_RDR0AD06            _RDR01AD0.Overlap_STR.RDR0AD0STR.Bits.RDR0AD06
    #define RDR0AD0_RDR0AD07            _RDR01AD0.Overlap_STR.RDR0AD0STR.Bits.RDR0AD07
    
    #define RDR0AD0_RDR0AD00_MASK       1U
    #define RDR0AD0_RDR0AD01_MASK       2U
    #define RDR0AD0_RDR0AD02_MASK       4U
    #define RDR0AD0_RDR0AD03_MASK       8U
    #define RDR0AD0_RDR0AD04_MASK       16U
    #define RDR0AD0_RDR0AD05_MASK       32U
    #define RDR0AD0_RDR0AD06_MASK       64U
    #define RDR0AD0_RDR0AD07_MASK       128U
    

    /*** RDR1AD0 - Port AD0L Reduced Drive Register; 0x00000275 ***/
    union {
      byte Byte;
      struct {
        byte RDR1AD00    :1;                                       /* Port AD0L reduced drive bit 0 */
        byte RDR1AD01    :1;                                       /* Port AD0L reduced drive bit 1 */
        byte RDR1AD02    :1;                                       /* Port AD0L reduced drive bit 2 */
        byte RDR1AD03    :1;                                       /* Port AD0L reduced drive bit 3 */
        byte RDR1AD04    :1;                                       /* Port AD0L reduced drive bit 4 */
        byte RDR1AD05    :1;                                       /* Port AD0L reduced drive bit 5 */
        byte RDR1AD06    :1;                                       /* Port AD0L reduced drive bit 6 */
        byte RDR1AD07    :1;                                       /* Port AD0L reduced drive bit 7 */
      } Bits;
    } RDR1AD0STR;
    #define RDR1AD0                     _RDR01AD0.Overlap_STR.RDR1AD0STR.Byte
    #define RDR1AD0_RDR1AD00            _RDR01AD0.Overlap_STR.RDR1AD0STR.Bits.RDR1AD00
    #define RDR1AD0_RDR1AD01            _RDR01AD0.Overlap_STR.RDR1AD0STR.Bits.RDR1AD01
    #define RDR1AD0_RDR1AD02            _RDR01AD0.Overlap_STR.RDR1AD0STR.Bits.RDR1AD02
    #define RDR1AD0_RDR1AD03            _RDR01AD0.Overlap_STR.RDR1AD0STR.Bits.RDR1AD03
    #define RDR1AD0_RDR1AD04            _RDR01AD0.Overlap_STR.RDR1AD0STR.Bits.RDR1AD04
    #define RDR1AD0_RDR1AD05            _RDR01AD0.Overlap_STR.RDR1AD0STR.Bits.RDR1AD05
    #define RDR1AD0_RDR1AD06            _RDR01AD0.Overlap_STR.RDR1AD0STR.Bits.RDR1AD06
    #define RDR1AD0_RDR1AD07            _RDR01AD0.Overlap_STR.RDR1AD0STR.Bits.RDR1AD07
    
    #define RDR1AD0_RDR1AD00_MASK       1U
    #define RDR1AD0_RDR1AD01_MASK       2U
    #define RDR1AD0_RDR1AD02_MASK       4U
    #define RDR1AD0_RDR1AD03_MASK       8U
    #define RDR1AD0_RDR1AD04_MASK       16U
    #define RDR1AD0_RDR1AD05_MASK       32U
    #define RDR1AD0_RDR1AD06_MASK       64U
    #define RDR1AD0_RDR1AD07_MASK       128U
    
  } Overlap_STR;

