frostfire45/Codewarrior/Lib/hc12c/include/mc9s12xs64.h
  struct {
    word RDR1AD00    :1;                                       /* Port AD0 reduced drive bit 0 */
    word RDR1AD01    :1;                                       /* Port AD0 reduced drive bit 1 */
    word RDR1AD02    :1;                                       /* Port AD0 reduced drive bit 2 */
    word RDR1AD03    :1;                                       /* Port AD0 reduced drive bit 3 */
    word RDR1AD04    :1;                                       /* Port AD0 reduced drive bit 4 */
    word RDR1AD05    :1;                                       /* Port AD0 reduced drive bit 5 */
    word RDR1AD06    :1;                                       /* Port AD0 reduced drive bit 6 */
    word RDR1AD07    :1;                                       /* Port AD0 reduced drive bit 7 */
    word RDR0AD00    :1;                                       /* Port AD0 reduced drive bit 8 */
    word RDR0AD01    :1;                                       /* Port AD0 reduced drive bit 9 */
    word RDR0AD02    :1;                                       /* Port AD0 reduced drive bit 10 */
    word RDR0AD03    :1;                                       /* Port AD0 reduced drive bit 11 */
    word RDR0AD04    :1;                                       /* Port AD0 reduced drive bit 12 */
    word RDR0AD05    :1;                                       /* Port AD0 reduced drive bit 13 */
    word RDR0AD06    :1;                                       /* Port AD0 reduced drive bit 14 */
    word RDR0AD07    :1;                                       /* Port AD0 reduced drive bit 15 */
  } Bits;
  struct {
    word grpRDR1AD0 :8;
    word grpRDR0AD0 :8;
  } MergedBits;
} RDR01AD0STR;
extern volatile RDR01AD0STR _RDR01AD0 @(REG_BASE + 0x00000274UL);
#define RDR01AD0                        _RDR01AD0.Word
#define RDR01AD0_RDR1AD00               _RDR01AD0.Bits.RDR1AD00
#define RDR01AD0_RDR1AD01               _RDR01AD0.Bits.RDR1AD01
#define RDR01AD0_RDR1AD02               _RDR01AD0.Bits.RDR1AD02
#define RDR01AD0_RDR1AD03               _RDR01AD0.Bits.RDR1AD03
#define RDR01AD0_RDR1AD04               _RDR01AD0.Bits.RDR1AD04
#define RDR01AD0_RDR1AD05               _RDR01AD0.Bits.RDR1AD05
#define RDR01AD0_RDR1AD06               _RDR01AD0.Bits.RDR1AD06
#define RDR01AD0_RDR1AD07               _RDR01AD0.Bits.RDR1AD07
#define RDR01AD0_RDR0AD00               _RDR01AD0.Bits.RDR0AD00
#define RDR01AD0_RDR0AD01               _RDR01AD0.Bits.RDR0AD01
#define RDR01AD0_RDR0AD02               _RDR01AD0.Bits.RDR0AD02
#define RDR01AD0_RDR0AD03               _RDR01AD0.Bits.RDR0AD03
#define RDR01AD0_RDR0AD04               _RDR01AD0.Bits.RDR0AD04
#define RDR01AD0_RDR0AD05               _RDR01AD0.Bits.RDR0AD05
#define RDR01AD0_RDR0AD06               _RDR01AD0.Bits.RDR0AD06
#define RDR01AD0_RDR0AD07               _RDR01AD0.Bits.RDR0AD07
#define RDR01AD0_RDR1AD0                _RDR01AD0.MergedBits.grpRDR1AD0
#define RDR01AD0_RDR0AD0                _RDR01AD0.MergedBits.grpRDR0AD0

#define RDR01AD0_RDR1AD00_MASK          1U
#define RDR01AD0_RDR1AD01_MASK          2U
#define RDR01AD0_RDR1AD02_MASK          4U
#define RDR01AD0_RDR1AD03_MASK          8U
#define RDR01AD0_RDR1AD04_MASK          16U
#define RDR01AD0_RDR1AD05_MASK          32U
#define RDR01AD0_RDR1AD06_MASK          64U
#define RDR01AD0_RDR1AD07_MASK          128U
#define RDR01AD0_RDR0AD00_MASK          256U
#define RDR01AD0_RDR0AD01_MASK          512U
#define RDR01AD0_RDR0AD02_MASK          1024U
#define RDR01AD0_RDR0AD03_MASK          2048U
#define RDR01AD0_RDR0AD04_MASK          4096U
#define RDR01AD0_RDR0AD05_MASK          8192U
#define RDR01AD0_RDR0AD06_MASK          16384U
#define RDR01AD0_RDR0AD07_MASK          32768U
#define RDR01AD0_RDR1AD0_MASK           255U
#define RDR01AD0_RDR1AD0_BITNUM         0U
#define RDR01AD0_RDR0AD0_MASK           65280U
#define RDR01AD0_RDR0AD0_BITNUM         8U


/*** PER01AD0 - Port AD0 Pull Up Enable Register; 0x00000276 ***/
typedef union {
  word Word;
   /* Overlapped registers: */
  struct {
    /*** PER0AD0 - Port AD0H Pull Up Enable Register; 0x00000276 ***/
    union {
      byte Byte;
      struct {
        byte PER0AD00    :1;                                       /* Port AD0H pull up enable bit 0 */
        byte PER0AD01    :1;                                       /* Port AD0H pull up enable bit 1 */
        byte PER0AD02    :1;                                       /* Port AD0H pull up enable bit 2 */
        byte PER0AD03    :1;                                       /* Port AD0H pull up enable bit 3 */
        byte PER0AD04    :1;                                       /* Port AD0H pull up enable bit 4 */
        byte PER0AD05    :1;                                       /* Port AD0H pull up enable bit 5 */
        byte PER0AD06    :1;                                       /* Port AD0H pull up enable bit 6 */
        byte PER0AD07    :1;                                       /* Port AD0H pull up enable bit 7 */
      } Bits;
    } PER0AD0STR;
    #define PER0AD0                     _PER01AD0.Overlap_STR.PER0AD0STR.Byte
    #define PER0AD0_PER0AD00            _PER01AD0.Overlap_STR.PER0AD0STR.Bits.PER0AD00
    #define PER0AD0_PER0AD01            _PER01AD0.Overlap_STR.PER0AD0STR.Bits.PER0AD01
    #define PER0AD0_PER0AD02            _PER01AD0.Overlap_STR.PER0AD0STR.Bits.PER0AD02
    #define PER0AD0_PER0AD03            _PER01AD0.Overlap_STR.PER0AD0STR.Bits.PER0AD03
    #define PER0AD0_PER0AD04            _PER01AD0.Overlap_STR.PER0AD0STR.Bits.PER0AD04
    #define PER0AD0_PER0AD05            _PER01AD0.Overlap_STR.PER0AD0STR.Bits.PER0AD05
    #define PER0AD0_PER0AD06            _PER01AD0.Overlap_STR.PER0AD0STR.Bits.PER0AD06
    #define PER0AD0_PER0AD07            _PER01AD0.Overlap_STR.PER0AD0STR.Bits.PER0AD07
    
    #define PER0AD0_PER0AD00_MASK       1U
    #define PER0AD0_PER0AD01_MASK       2U
    #define PER0AD0_PER0AD02_MASK       4U
    #define PER0AD0_PER0AD03_MASK       8U
    #define PER0AD0_PER0AD04_MASK       16U
    #define PER0AD0_PER0AD05_MASK       32U
    #define PER0AD0_PER0AD06_MASK       64U
    #define PER0AD0_PER0AD07_MASK       128U
    

    /*** PER1AD0 - Port AD0L Pull Up Enable Register; 0x00000277 ***/
    union {
      byte Byte;
      struct {
        byte PER1AD00    :1;                                       /* Port AD0L pull up enable bit 0 */
        byte PER1AD01    :1;                                       /* Port AD0L pull up enable bit 1 */
        byte PER1AD02    :1;                                       /* Port AD0L pull up enable bit 2 */
        byte PER1AD03    :1;                                       /* Port AD0L pull up enable bit 3 */
        byte PER1AD04    :1;                                       /* Port AD0L pull up enable bit 4 */
        byte PER1AD05    :1;                                       /* Port AD0L pull up enable bit 5 */
        byte PER1AD06    :1;                                       /* Port AD0L pull up enable bit 6 */
        byte PER1AD07    :1;                                       /* Port AD0L pull up enable bit 7 */
      } Bits;
    } PER1AD0STR;
    #define PER1AD0                     _PER01AD0.Overlap_STR.PER1AD0STR.Byte
    #define PER1AD0_PER1AD00            _PER01AD0.Overlap_STR.PER1AD0STR.Bits.PER1AD00
    #define PER1AD0_PER1AD01            _PER01AD0.Overlap_STR.PER1AD0STR.Bits.PER1AD01
    #define PER1AD0_PER1AD02            _PER01AD0.Overlap_STR.PER1AD0STR.Bits.PER1AD02
    #define PER1AD0_PER1AD03            _PER01AD0.Overlap_STR.PER1AD0STR.Bits.PER1AD03
    #define PER1AD0_PER1AD04            _PER01AD0.Overlap_STR.PER1AD0STR.Bits.PER1AD04
    #define PER1AD0_PER1AD05            _PER01AD0.Overlap_STR.PER1AD0STR.Bits.PER1AD05
    #define PER1AD0_PER1AD06            _PER01AD0.Overlap_STR.PER1AD0STR.Bits.PER1AD06
    #define PER1AD0_PER1AD07            _PER01AD0.Overlap_STR.PER1AD0STR.Bits.PER1AD07
    
